/*
----------description----------
有一楼梯共m级，刚开始时你在第一级，若每次只能跨上一级或二级，要走上第m级，共有多少走法？

注：规定从一级到一级有0种走法。


----------input----------
输入数据首先包含一个整数n(1<=n<=100)，表示测试实例的个数，然后是n行数据，每行包含一个整数m，（1<=m<=40), 表示楼梯的级数。


----------output----------
对于每个测试实例，请输出不同走法的数量。


----------sample_input----------
2
2
3
----------sample_putput----------
1
2
*/
/////////////////////////////
#include<stdio.h>
int main()
{
	 int fun(int n);
	int N;
	int m;
	int i;
	int a[41];
	scanf("%d",&N);
	while(N--)
	{
		a[1]=0;
		a[2]=1;
		a[3]=2;
		
		scanf("%d",&m);
		if(m<=4)
			printf("%d\n",m-1);
		else
		{
			for(i=4;i<=m;i++)
				a[i]=a[i-1]+a[i-2];
			printf("%d\n",a[m]);
		}
	}
	return 0;
}
